uhnp/src/Enums/ВидыОперацийУправлениеЛимитами/ВидыОперацийУправлениеЛимитами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийУправлениеЛимитами</name>
  <enumValues>
    <name>УстановкаЛимитовПоИсточнику</name>
  </enumValues>
  <enumValues>
    <name>ОтменаУстановкиЛимитов</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеПериодовЛимитирования</name>
  </enumValues>
  <enumValues>
    <name>ОткрытиеПериодовЛимитирования</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/УправлениеЛимитами/УправлениеЛимитами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УправлениеЛимитами</name>
  <registerRecords>InformationRegister.УдалитьУстановкаЛимитовПоДаннымБюджетированияСостояния</registerRecords>
  <registerRecords>InformationRegister.СостояниеУстановкиЛимитовОбъектами</registerRecords>
  <registerRecords>AccumulationRegister.ОперацииБюджетов</registerRecords>
  <registerRecords>InformationRegister.СостояниеПериодовЛимитирования</registerRecords>
  <registerRecords>AccumulationRegister.УдалитьЛимитыПоБюджетам</registerRecords>
  <registerRecords>InformationRegister.УдалитьСостояниеПериодовЛимитирования</registerRecords>
  <registerRecords>InformationRegister.УстановкаЛимитовПоДаннымБюджетированияСостояния</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийУправлениеЛимитами</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоГода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ВидБюджета</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>УОП</name>
      <type>
        <types>DocumentRef.УправлениеПериодомСценария</types>
      </type>
    </attributes>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/CommonModules/УправлениеЛимитамиУХКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработатьРасшифровку(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт

	//Если СтрЗаканчиваетсяНа(ФормаОтчета.НастройкиОтчета.ПолноеИмя, "УстановкаЛимитов") Тогда
	//	ОбработатьРасшифровкуУстановкаЛимитов(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка);
	//КонецЕсли

КонецПроцедуры
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура НавигационнаяКомандаВложеннойФормы(Форма, Команда) Экспорт
	
	Если Форма.ВладелецФормы = Неопределено Тогда
		ОсновнаяФорма = Форма;
	Иначе
		ОсновнаяФорма = Форма.ВладелецФормы;
	КонецЕсли;
	
	ВложенныеФормы = ОсновнаяФорма.ВложенныеФормы;
	ПараметрыФормы = ВложенныеФормы.НайтиПоЗначению(Команда.Имя);
	Если ПараметрыФормы <> Неопределено Тогда
		АктивнаяФорма = ВложенныеФормы.НайтиПоЗначению(Команда.Имя).Представление;
	
		ОсновноеОкно = Форма.Окно;
		Для Каждого ФормаСодержимого Из ОсновноеОкно.Содержимое Цикл
			Если ФормаСодержимого.ИмяФормы = АктивнаяФорма Тогда
				ФормаСодержимого.Активизировать();
				Оповестить("НавигационнаяКомандаВложеннойФормы", Команда, ФормаСодержимого);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Оповестить("НавигационнаяКомандаВложеннойФормы", Команда, ОсновнаяФорма);
	
КонецПроцедуры

#Область Отчеты

Процедура ОтчетПоЛимитамРасшифровать(Форма, Команда) Экспорт
	
	Расшифровка = Форма.ОтчетТабличныйДокумент.ВыделенныеОбласти[0].Расшифровка;
	
	Если Расшифровка <> Неопределено Тогда
		СтандартнаяОбработка = Истина;
		
		ОбработатьРасшифровку(Форма, Форма.Элементы.ОтчетТабличныйДокумент, Расшифровка, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьРасшифровкуУстановкаЛимитовПараметрыРасшифровки(Знач ФормаОтчета, Знач Расшифровка)
	

КонецФункции

Функция ВыделенныеЯчейкиДляУстановкиЛимитов(ФормаОтчета, ВидБюджета)
	
	ИдентификаторыРасшифровки = ИдентификаторыРасшифровкиВыделенныхОбластей(ФормаОтчета.ОтчетТабличныйДокумент);
	Если ИдентификаторыРасшифровки.Количество() = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат УправлениеЛимитамиУХ.ЯчейкиДляУстановкиЛимитов(ФормаОтчета.ОтчетДанныеРасшифровки, ИдентификаторыРасшифровки, ВидБюджета);
	
КонецФункции

Процедура КонтрольИсполненияВыбраныЯчейкиСПолнымПериодом(ДанныеЯчеек, ПараметрыОтчета, ДопПараметры)
	
	Если ТипЗнч(ДопПараметры) <> Тип("Структура") Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Данные", Новый Массив);
	ПараметрыКоманды.Вставить("ДанныеВыбрано", Новый Массив);
	ПараметрыКоманды.Вставить("Валюты", Новый Массив);
	ПараметрыКоманды.Вставить("ВидБюджета", ПараметрыОтчета.Получить("ВидБюджета"));
	ПараметрыКоманды.Вставить("ПериодичностьЛимитирования", ПараметрыОтчета.Получить("ПериодичностьЛимитирования"));
	ПараметрыКоманды.Вставить("Предназначение", ПараметрыОтчета.Получить("Предназначение"));
	ПараметрыКоманды.Вставить("НачалоПериода", НачалоГода(ПараметрыОтчета.Получить("ОтчетнаяДата")));
	ПараметрыКоманды.Вставить("ОкончаниеПериода", НачалоДня(КонецГода(ПараметрыОтчета.Получить("ОтчетнаяДата"))));
	
	ИменаСвойств = "ВидБюджета, ПериодЛимитирования, Валюта, ЦФО, Проект";
	
	Для Каждого Ячейка Из ДанныеЯчеек Цикл
		
		Если НЕ Ячейка.Свойство("НачалоПериода") Или НЕ Ячейка.Свойство("Периодичность") Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаНачалаПериода = Ячейка.НачалоПериода;
		Если Не ЗначениеЗаполнено(ДатаНачалаПериода) Тогда
			Продолжить;
		КонецЕсли;
		
		Свойства = Новый Структура("ВидБюджета, НачалоПериода, Периодичность", ПараметрыОтчета.Получить("ВидБюджета"), Ячейка.НачалоПериода, Ячейка.Периодичность);
		Найдено = Ложь;
		Для Каждого ДанныеВыбора Из ПараметрыКоманды.ДанныеВыбрано Цикл
			Если Свойства.ВидБюджета = ДанныеВыбора.ВидБюджета И Свойства.НачалоПериода = ДанныеВыбора.НачалоПериода И Свойства.Периодичность = ДанныеВыбора.Периодичность Тогда
				Найдено = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Не Найдено Тогда
			ПараметрыКоманды.ДанныеВыбрано.Добавить(Свойства);
		КонецЕсли;
		
		Для Каждого ЦФОПроект Из ПараметрыОтчета.Получить("ЦФОПроектыПериодыЛимитированияВалюты") Цикл
			
			Если ЦФОПроект.ДатаНачала > ДатаНачалаПериода Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыКоманды.Валюты.Добавить(ЦФОПроект.Валюта);
			
			Данные = Новый Структура(ИменаСвойств);
			ЗаполнитьЗначенияСвойств(Данные, Свойства);
			ЗаполнитьЗначенияСвойств(Данные, ЦФОПроект, "ЦФО, Проект, Валюта");
			ПараметрыКоманды.Данные.Добавить(Данные);
		КонецЦикла;
		
	КонецЦикла;
	
	ПараметрыКоманды.Валюты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПараметрыКоманды.Валюты);
	
	ДопПараметры.Вставить("ВыбранныеПериоды", ПараметрыКоманды);
	
КонецПроцедуры

Процедура КонтрольИсполненияВыбраныЯчейкиПолнымНаборомАналитикЛимитирования(ДанныеЯчеек, ПараметрыОтчета, ДопПараметры)
	
	Если ТипЗнч(ДопПараметры) <> Тип("Структура") Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ВидБюджета", ПараметрыОтчета.Получить("ВидБюджета"));
	ПараметрыКоманды.Вставить("Данные", Новый Массив);
	ПараметрыКоманды.Вставить("ДанныеВыбрано", Новый Массив);
	
	ОбязательныеСвойства = "ЦФО,Проект,СтатьяБюджета,Аналитика1,Аналитика2,Аналитика3,Аналитика4,Аналитика5,Аналитика6,НачалоПериода, Периодичность, Валюта,Доступно";
	
	Для Каждого Ячейка Из ДанныеЯчеек Цикл
		
		Свойства = Новый Структура(ОбязательныеСвойства);
		ЗаполнитьЗначенияСвойств(Свойства, Ячейка);
		ПараметрыКоманды.Данные.Добавить(Свойства);
		ПараметрыКоманды.ДанныеВыбрано.Добавить(Свойства);
		
	КонецЦикла;
	
	ДопПараметры.Вставить("ПолныйНаборАналитик", ПараметрыКоманды);
	
КонецПроцедуры

Процедура ДанныеРасшифровкиПоляРекурсивно(ДанныеРасшифровки, ИДРасшифровки, Результат)
	
	ЭлементРасшифровки = ДанныеРасшифровки.Элементы[ИДРасшифровки];
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		// Получаем данные поля
		Для каждого Элемент Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			Результат.Вставить(Элемент.Поле, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	// Получаем данные родителей
	Для Каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		ДанныеРасшифровкиПоляРекурсивно(ДанныеРасшифровки, Родитель.Идентификатор, Результат);
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыРасшифровкиВыделенныхОбластей(ТабДок)
	
	МассивИдентификаторовРасшифровки = Новый Массив;
	Для каждого ВыделеннаяОбласть Из ТабДок.ВыделенныеОбласти Цикл
		Если ТипЗнч(ВыделеннаяОбласть) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Для НомерСтолбца = ВыделеннаяОбласть.Лево По ВыделеннаяОбласть.Право Цикл
				Для НомерСтроки = ВыделеннаяОбласть.Верх По ВыделеннаяОбласть.Низ Цикл
					Ячейка = ТабДок.Область(НомерСтроки, НомерСтолбца, НомерСтроки, НомерСтолбца);
					Если Ячейка.ТипОбласти <> ПредопределенноеЗначение("ТипОбластиЯчеекТабличногоДокумента.Прямоугольник") Тогда
						Продолжить;
					КонецЕсли;
					Если Ячейка.Расшифровка <> Неопределено Тогда
						МассивИдентификаторовРасшифровки.Добавить(Ячейка.Расшифровка);
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;	
		КонецЕсли;		
	КонецЦикла;
	
	Возврат МассивИдентификаторовРасшифровки;
	
КонецФункции

Процедура ОбработкаДополнительнойРасшифровкиКонтрольИсполненияЗавершение(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт
	
	Если ВыполненноеДействие = Неопределено Тогда 
		Возврат;
	ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
		// Оформление
		ПереформироватьОтчет( Неопределено, ДополнительныеПараметры.ФормаОтчета);
	ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		// Открытие значений
		ПоказатьЗначение(, ПараметрВыполненногоДействия);
	ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать Тогда
		Расшифровка = Новый ОписаниеОбработкиРасшифровкиКомпоновкиДанных(ДополнительныеПараметры.ФормаОтчета.ОтчетДанныеРасшифровки,
																		ДополнительныеПараметры.Расшифровка,
																		ПараметрВыполненногоДействия);
																		
		ОткрытьФорму(ДополнительныеПараметры.ФормаОтчета.ИмяФормы,
						Новый Структура("Расшифровка, СформироватьПриОткрытии", Расшифровка, Истина),
						ДополнительныеПараметры.ФормаОтчета,
						Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаДополнительнойРасшифровкиУстановкаЛимитовЗавершение(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт
	
	Если ВыполненноеДействие = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКоманд = ДополнительныеПараметры.ПараметрыКоманд;
	
	Если ВыполненноеДействие = "УстановитьЛимитыПоЦФО" Тогда
		СоздатьДокументУправленияЛимитами(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправлениеЛимитами.УстановкаЛимитовПоИсточнику"),
			ПараметрыКоманд.ВыбранныеЦФОПроект, 
			ДополнительныеПараметры.ПараметрыОтчета);
	ИначеЕсли ВыполненноеДействие = "УстановитьЛимитыПоПериоду"	Тогда
		СоздатьДокументУправленияЛимитами(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправлениеЛимитами.УстановкаЛимитовПоИсточнику"),
			ПараметрыКоманд.ВыбранныеПериоды, 
			ДополнительныеПараметры.ПараметрыОтчета);
	ИначеЕсли ВыполненноеДействие = "ОтменитьУстановкуЛимитовПоЦФО" Тогда
		СоздатьДокументУправленияЛимитами(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправлениеЛимитами.ОтменаУстановкиЛимитов"),
			ПараметрыКоманд.ВыбранныеЦФОПроект, 
			ДополнительныеПараметры.ПараметрыОтчета);
	ИначеЕсли ВыполненноеДействие = "ОтменитьУстановкуЛимитовПоПериоду" Тогда
		СоздатьДокументУправленияЛимитами(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправлениеЛимитами.ОтменаУстановкиЛимитов"),
			ПараметрыКоманд.ВыбранныеПериоды, 
			ДополнительныеПараметры.ПараметрыОтчета);
	ИначеЕсли ВыполненноеДействие = "ЗакрытьПериодПоПериоду" Тогда
		СоздатьДокументУправленияЛимитами(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправлениеЛимитами.ЗакрытиеПериодовЛимитирования"),
			ПараметрыКоманд.ВыбранныеПериоды, 
			ДополнительныеПараметры.ПараметрыОтчета);
	ИначеЕсли ВыполненноеДействие = "ОткрытьПериодПоПериоду" Тогда
		СоздатьДокументУправленияЛимитами(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправлениеЛимитами.ОткрытиеПериодовЛимитирования"),
			ПараметрыКоманд.ВыбранныеПериоды, 
			ДополнительныеПараметры.ПараметрыОтчета);
	ИначеЕсли ВыполненноеДействие = "ЗакрытьПериодПоЦФО" Тогда
		СоздатьДокументУправленияЛимитами(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправлениеЛимитами.ЗакрытиеПериодовЛимитирования"),
			ПараметрыКоманд.ВыбранныеЦФОПроект, 
			ДополнительныеПараметры.ПараметрыОтчета);
	ИначеЕсли ВыполненноеДействие = "ОткрытьПериодПоЦФО" Тогда
		СоздатьДокументУправленияЛимитами(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправлениеЛимитами.ОткрытиеПериодовЛимитирования"),
			ПараметрыКоманд.ВыбранныеЦФОПроект, 
			ДополнительныеПараметры.ПараметрыОтчета);
	ИначеЕсли ВыполненноеДействие = "ОткрытьСписокДокументовУстановки" Тогда
		ОткрытьСписокДокументовУстановкиЛимитов(ПараметрыКоманд.ВыбранныеЦФОПроект);
	ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать Тогда
		Расшифровка = Новый ОписаниеОбработкиРасшифровкиКомпоновкиДанных(ДополнительныеПараметры.ФормаОтчета.ОтчетДанныеРасшифровки,
																		ДополнительныеПараметры.Расшифровка,
																		ПараметрВыполненногоДействия);
																		
		ОткрытьФорму(ДополнительныеПараметры.ФормаОтчета.ИмяФормы,
						Новый Структура("Расшифровка, СформироватьПриОткрытии", Расшифровка, Истина),
						ДополнительныеПараметры.ФормаОтчета,
						Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьДокументУправленияЛимитами(ВыбранноеДействие, ДанныеВыбранныхЯчеек, ПараметрыОтчета)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВидОперации", 	ВыбранноеДействие);
	ЗначенияЗаполнения.Вставить("НачалоГода", 	ПараметрыОтчета.Получить("ОтчетнаяДата"));
	ЗначенияЗаполнения.Вставить("УОП", 			ПараметрыОтчета.Получить("УОП"));
	ЗначенияЗаполнения.Вставить("Данные", 		ДанныеВыбранныхЯчеек.Данные);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.УправлениеЛимитами.Форма.ФормаДокумента", ДопПараметры, ЭтотОбъект);
	
КонецПроцедуры

Процедура ОткрытьСписокДокументовУстановкиЛимитов(ВыбранныеЦФОПроект)
	
	Если ВыбранныеЦФОПроект.Данные.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ВыбранныеЦФОПроект.Данные[0];
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидОперации", 			ПредопределенноеЗначение("Перечисление.ВидыОперацийУправлениеЛимитами.УстановкаЛимитовПоИсточнику"));
	Отбор.Вставить("ВидБюджета", 			Данные.ВидБюджета);
	Отбор.Вставить("ПериодЛимитирования", 	Данные.ПериодЛимитирования);
	Отбор.Вставить("ЦФО", 					Данные.ЦФО);
	Отбор.Вставить("Проект", 				Данные.Проект);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Отбор", Отбор);
	ДопПараметры.Вставить("КлючПользовательскихНастроек", "СписокДокументовУправлениеЛимитамиСОтборами");
	
	ОткрытьФорму("Документ.УправлениеЛимитами.Форма.ФормаСписка", ДопПараметры, ЭтотОбъект);
	
КонецПроцедуры

Процедура ПереформироватьОтчет(Результат, ДопПараметры) Экспорт
	
	ОтчетыКлиент.СформироватьОтчет(ДопПараметры.ФормаОтчета);
	
КонецПроцедуры

#КонецОбласти
